feaser/openblt/demo_programs/Target/Demo/HCS12_Evbplus_Dragon12p_CodeWarrior/Boot/lib/mc9s12dg256.h
#define PBCTL_PBOVI_MASK                2U
#define PBCTL_PBEN_MASK                 64U


/*** PBFLG - Pulse Accumulator B Flag Register; 0x00000071 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte PBOVF       :1;                                       /* Pulse Accumulator B Overflow Flag */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} PBFLGSTR;
extern volatile PBFLGSTR _PBFLG @(REG_BASE + 0x00000071UL);
#define PBFLG                           _PBFLG.Byte
#define PBFLG_PBOVF                     _PBFLG.Bits.PBOVF

#define PBFLG_PBOVF_MASK                2U


/*** PA32H - 8-Bit Pulse Accumulators Holding 32 Register; 0x00000072 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PA3H - 8-Bit Pulse Accumulators Holding 3 Register; 0x00000072 ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Pulse Accumulator Bit 0 */
        byte BIT1        :1;                                       /* Pulse Accumulator Bit 1 */
        byte BIT2        :1;                                       /* Pulse Accumulator Bit 2 */
        byte BIT3        :1;                                       /* Pulse Accumulator Bit 3 */
        byte BIT4        :1;                                       /* Pulse Accumulator Bit 4 */
        byte BIT5        :1;                                       /* Pulse Accumulator Bit 5 */
        byte BIT6        :1;                                       /* Pulse Accumulator Bit 6 */
        byte BIT7        :1;                                       /* Pulse Accumulator Bit 7 */
      } Bits;
    } PA3HSTR;
    #define PA3H                        _PA32H.Overlap_STR.PA3HSTR.Byte
    #define PA3H_BIT0                   _PA32H.Overlap_STR.PA3HSTR.Bits.BIT0
    #define PA3H_BIT1                   _PA32H.Overlap_STR.PA3HSTR.Bits.BIT1
    #define PA3H_BIT2                   _PA32H.Overlap_STR.PA3HSTR.Bits.BIT2
    #define PA3H_BIT3                   _PA32H.Overlap_STR.PA3HSTR.Bits.BIT3
    #define PA3H_BIT4                   _PA32H.Overlap_STR.PA3HSTR.Bits.BIT4
    #define PA3H_BIT5                   _PA32H.Overlap_STR.PA3HSTR.Bits.BIT5
    #define PA3H_BIT6                   _PA32H.Overlap_STR.PA3HSTR.Bits.BIT6
    #define PA3H_BIT7                   _PA32H.Overlap_STR.PA3HSTR.Bits.BIT7
    
    #define PA3H_BIT0_MASK              1U
    #define PA3H_BIT1_MASK              2U
    #define PA3H_BIT2_MASK              4U
    #define PA3H_BIT3_MASK              8U
    #define PA3H_BIT4_MASK              16U
    #define PA3H_BIT5_MASK              32U
    #define PA3H_BIT6_MASK              64U
    #define PA3H_BIT7_MASK              128U
    

    /*** PA2H - 8-Bit Pulse Accumulators Holding 2 Register; 0x00000073 ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Pulse Accumulator Bit 0 */
        byte BIT1        :1;                                       /* Pulse Accumulator Bit 1 */
        byte BIT2        :1;                                       /* Pulse Accumulator Bit 2 */
        byte BIT3        :1;                                       /* Pulse Accumulator Bit 3 */
        byte BIT4        :1;                                       /* Pulse Accumulator Bit 4 */
        byte BIT5        :1;                                       /* Pulse Accumulator Bit 5 */
        byte BIT6        :1;                                       /* Pulse Accumulator Bit 6 */
        byte BIT7        :1;                                       /* Pulse Accumulator Bit 7 */
      } Bits;
    } PA2HSTR;
    #define PA2H                        _PA32H.Overlap_STR.PA2HSTR.Byte
    #define PA2H_BIT0                   _PA32H.Overlap_STR.PA2HSTR.Bits.BIT0
    #define PA2H_BIT1                   _PA32H.Overlap_STR.PA2HSTR.Bits.BIT1
    #define PA2H_BIT2                   _PA32H.Overlap_STR.PA2HSTR.Bits.BIT2
    #define PA2H_BIT3                   _PA32H.Overlap_STR.PA2HSTR.Bits.BIT3
    #define PA2H_BIT4                   _PA32H.Overlap_STR.PA2HSTR.Bits.BIT4
    #define PA2H_BIT5                   _PA32H.Overlap_STR.PA2HSTR.Bits.BIT5
    #define PA2H_BIT6                   _PA32H.Overlap_STR.PA2HSTR.Bits.BIT6
    #define PA2H_BIT7                   _PA32H.Overlap_STR.PA2HSTR.Bits.BIT7
    
    #define PA2H_BIT0_MASK              1U
    #define PA2H_BIT1_MASK              2U
    #define PA2H_BIT2_MASK              4U
    #define PA2H_BIT3_MASK              8U
    #define PA2H_BIT4_MASK              16U
    #define PA2H_BIT5_MASK              32U
    #define PA2H_BIT6_MASK              64U
    #define PA2H_BIT7_MASK              128U
    
  } Overlap_STR;

  struct {
    word BIT0        :1;                                       /* Pulse Accumulator Bit 0 */
    word BIT1        :1;                                       /* Pulse Accumulator Bit 1 */
    word BIT2        :1;                                       /* Pulse Accumulator Bit 2 */
    word BIT3        :1;                                       /* Pulse Accumulator Bit 3 */
    word BIT4        :1;                                       /* Pulse Accumulator Bit 4 */
    word BIT5        :1;                                       /* Pulse Accumulator Bit 5 */
    word BIT6        :1;                                       /* Pulse Accumulator Bit 6 */
    word BIT7        :1;                                       /* Pulse Accumulator Bit 7 */
    word BIT8        :1;                                       /* Pulse Accumulator Bit 8 */
    word BIT9        :1;                                       /* Pulse Accumulator Bit 9 */
    word BIT10       :1;                                       /* Pulse Accumulator Bit 10 */
    word BIT11       :1;                                       /* Pulse Accumulator Bit 11 */
    word BIT12       :1;                                       /* Pulse Accumulator Bit 12 */
    word BIT13       :1;                                       /* Pulse Accumulator Bit 13 */
    word BIT14       :1;                                       /* Pulse Accumulator Bit 14 */
    word BIT15       :1;                                       /* Pulse Accumulator Bit 15 */
  } Bits;
} PA32HSTR;
extern volatile PA32HSTR _PA32H @(REG_BASE + 0x00000072UL);
#define PA32H                           _PA32H.Word
#define PA32H_BIT0                      _PA32H.Bits.BIT0
#define PA32H_BIT1                      _PA32H.Bits.BIT1
#define PA32H_BIT2                      _PA32H.Bits.BIT2
#define PA32H_BIT3                      _PA32H.Bits.BIT3
#define PA32H_BIT4                      _PA32H.Bits.BIT4
#define PA32H_BIT5                      _PA32H.Bits.BIT5
#define PA32H_BIT6                      _PA32H.Bits.BIT6
#define PA32H_BIT7                      _PA32H.Bits.BIT7
#define PA32H_BIT8                      _PA32H.Bits.BIT8
#define PA32H_BIT9                      _PA32H.Bits.BIT9
#define PA32H_BIT10                     _PA32H.Bits.BIT10
#define PA32H_BIT11                     _PA32H.Bits.BIT11
#define PA32H_BIT12                     _PA32H.Bits.BIT12
#define PA32H_BIT13                     _PA32H.Bits.BIT13
#define PA32H_BIT14                     _PA32H.Bits.BIT14
#define PA32H_BIT15                     _PA32H.Bits.BIT15

#define PA32H_BIT0_MASK                 1U
#define PA32H_BIT1_MASK                 2U
#define PA32H_BIT2_MASK                 4U
#define PA32H_BIT3_MASK                 8U
#define PA32H_BIT4_MASK                 16U
#define PA32H_BIT5_MASK                 32U
#define PA32H_BIT6_MASK                 64U
#define PA32H_BIT7_MASK                 128U
#define PA32H_BIT8_MASK                 256U
#define PA32H_BIT9_MASK                 512U
#define PA32H_BIT10_MASK                1024U
#define PA32H_BIT11_MASK                2048U
#define PA32H_BIT12_MASK                4096U
#define PA32H_BIT13_MASK                8192U
#define PA32H_BIT14_MASK                16384U
#define PA32H_BIT15_MASK                32768U


/*** PA10H - 8-Bit Pulse Accumulators Holding 10 Register; 0x00000074 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PA1H - 8-Bit Pulse Accumulators Holding 1 Register; 0x00000074 ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Pulse Accumulator Bit 0 */
        byte BIT1        :1;                                       /* Pulse Accumulator Bit 1 */
        byte BIT2        :1;                                       /* Pulse Accumulator Bit 2 */
        byte BIT3        :1;                                       /* Pulse Accumulator Bit 3 */
        byte BIT4        :1;                                       /* Pulse Accumulator Bit 4 */
        byte BIT5        :1;                                       /* Pulse Accumulator Bit 5 */
        byte BIT6        :1;                                       /* Pulse Accumulator Bit 6 */
        byte BIT7        :1;                                       /* Pulse Accumulator Bit 7 */
      } Bits;
    } PA1HSTR;
    #define PA1H                        _PA10H.Overlap_STR.PA1HSTR.Byte
    #define PA1H_BIT0                   _PA10H.Overlap_STR.PA1HSTR.Bits.BIT0
    #define PA1H_BIT1                   _PA10H.Overlap_STR.PA1HSTR.Bits.BIT1
    #define PA1H_BIT2                   _PA10H.Overlap_STR.PA1HSTR.Bits.BIT2
    #define PA1H_BIT3                   _PA10H.Overlap_STR.PA1HSTR.Bits.BIT3
    #define PA1H_BIT4                   _PA10H.Overlap_STR.PA1HSTR.Bits.BIT4
    #define PA1H_BIT5                   _PA10H.Overlap_STR.PA1HSTR.Bits.BIT5
    #define PA1H_BIT6                   _PA10H.Overlap_STR.PA1HSTR.Bits.BIT6
    #define PA1H_BIT7                   _PA10H.Overlap_STR.PA1HSTR.Bits.BIT7
    
    #define PA1H_BIT0_MASK              1U
    #define PA1H_BIT1_MASK              2U
    #define PA1H_BIT2_MASK              4U
    #define PA1H_BIT3_MASK              8U
    #define PA1H_BIT4_MASK              16U
    #define PA1H_BIT5_MASK              32U
    #define PA1H_BIT6_MASK              64U
    #define PA1H_BIT7_MASK              128U
    

