feaser/openblt/demo_programs/Target/Demo/HCS12_Evbplus_Dragon12p_CodeWarrior/Boot/lib/mc9s12dg256.h
    /*** PA0H - 8-Bit Pulse Accumulators Holding 0 Register; 0x00000075 ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Pulse Accumulator Bit 0 */
        byte BIT1        :1;                                       /* Pulse Accumulator Bit 1 */
        byte BIT2        :1;                                       /* Pulse Accumulator Bit 2 */
        byte BIT3        :1;                                       /* Pulse Accumulator Bit 3 */
        byte BIT4        :1;                                       /* Pulse Accumulator Bit 4 */
        byte BIT5        :1;                                       /* Pulse Accumulator Bit 5 */
        byte BIT6        :1;                                       /* Pulse Accumulator Bit 6 */
        byte BIT7        :1;                                       /* Pulse Accumulator Bit 7 */
      } Bits;
    } PA0HSTR;
    #define PA0H                        _PA10H.Overlap_STR.PA0HSTR.Byte
    #define PA0H_BIT0                   _PA10H.Overlap_STR.PA0HSTR.Bits.BIT0
    #define PA0H_BIT1                   _PA10H.Overlap_STR.PA0HSTR.Bits.BIT1
    #define PA0H_BIT2                   _PA10H.Overlap_STR.PA0HSTR.Bits.BIT2
    #define PA0H_BIT3                   _PA10H.Overlap_STR.PA0HSTR.Bits.BIT3
    #define PA0H_BIT4                   _PA10H.Overlap_STR.PA0HSTR.Bits.BIT4
    #define PA0H_BIT5                   _PA10H.Overlap_STR.PA0HSTR.Bits.BIT5
    #define PA0H_BIT6                   _PA10H.Overlap_STR.PA0HSTR.Bits.BIT6
    #define PA0H_BIT7                   _PA10H.Overlap_STR.PA0HSTR.Bits.BIT7
    
    #define PA0H_BIT0_MASK              1U
    #define PA0H_BIT1_MASK              2U
    #define PA0H_BIT2_MASK              4U
    #define PA0H_BIT3_MASK              8U
    #define PA0H_BIT4_MASK              16U
    #define PA0H_BIT5_MASK              32U
    #define PA0H_BIT6_MASK              64U
    #define PA0H_BIT7_MASK              128U
    
  } Overlap_STR;

  struct {
    word BIT0        :1;                                       /* Pulse Accumulator Bit 0 */
    word BIT1        :1;                                       /* Pulse Accumulator Bit 1 */
    word BIT2        :1;                                       /* Pulse Accumulator Bit 2 */
    word BIT3        :1;                                       /* Pulse Accumulator Bit 3 */
    word BIT4        :1;                                       /* Pulse Accumulator Bit 4 */
    word BIT5        :1;                                       /* Pulse Accumulator Bit 5 */
    word BIT6        :1;                                       /* Pulse Accumulator Bit 6 */
    word BIT7        :1;                                       /* Pulse Accumulator Bit 7 */
    word BIT8        :1;                                       /* Pulse Accumulator Bit 8 */
    word BIT9        :1;                                       /* Pulse Accumulator Bit 9 */
    word BIT10       :1;                                       /* Pulse Accumulator Bit 10 */
    word BIT11       :1;                                       /* Pulse Accumulator Bit 11 */
    word BIT12       :1;                                       /* Pulse Accumulator Bit 12 */
    word BIT13       :1;                                       /* Pulse Accumulator Bit 13 */
    word BIT14       :1;                                       /* Pulse Accumulator Bit 14 */
    word BIT15       :1;                                       /* Pulse Accumulator Bit 15 */
  } Bits;
} PA10HSTR;
extern volatile PA10HSTR _PA10H @(REG_BASE + 0x00000074UL);
#define PA10H                           _PA10H.Word
#define PA10H_BIT0                      _PA10H.Bits.BIT0
#define PA10H_BIT1                      _PA10H.Bits.BIT1
#define PA10H_BIT2                      _PA10H.Bits.BIT2
#define PA10H_BIT3                      _PA10H.Bits.BIT3
#define PA10H_BIT4                      _PA10H.Bits.BIT4
#define PA10H_BIT5                      _PA10H.Bits.BIT5
#define PA10H_BIT6                      _PA10H.Bits.BIT6
#define PA10H_BIT7                      _PA10H.Bits.BIT7
#define PA10H_BIT8                      _PA10H.Bits.BIT8
#define PA10H_BIT9                      _PA10H.Bits.BIT9
#define PA10H_BIT10                     _PA10H.Bits.BIT10
#define PA10H_BIT11                     _PA10H.Bits.BIT11
#define PA10H_BIT12                     _PA10H.Bits.BIT12
#define PA10H_BIT13                     _PA10H.Bits.BIT13
#define PA10H_BIT14                     _PA10H.Bits.BIT14
#define PA10H_BIT15                     _PA10H.Bits.BIT15

#define PA10H_BIT0_MASK                 1U
#define PA10H_BIT1_MASK                 2U
#define PA10H_BIT2_MASK                 4U
#define PA10H_BIT3_MASK                 8U
#define PA10H_BIT4_MASK                 16U
#define PA10H_BIT5_MASK                 32U
#define PA10H_BIT6_MASK                 64U
#define PA10H_BIT7_MASK                 128U
#define PA10H_BIT8_MASK                 256U
#define PA10H_BIT9_MASK                 512U
#define PA10H_BIT10_MASK                1024U
#define PA10H_BIT11_MASK                2048U
#define PA10H_BIT12_MASK                4096U
#define PA10H_BIT13_MASK                8192U
#define PA10H_BIT14_MASK                16384U
#define PA10H_BIT15_MASK                32768U


/*** MCCNT - Modulus Down-Counter Count Register; 0x00000076 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** MCCNThi - Modulus Down-Counter Count Register High; 0x00000076 ***/
    union {
      byte Byte;
    } MCCNThiSTR;
    #define MCCNThi                     _MCCNT.Overlap_STR.MCCNThiSTR.Byte
    

    /*** MCCNTlo - Modulus Down-Counter Count Register Low; 0x00000077 ***/
    union {
      byte Byte;
    } MCCNTloSTR;
    #define MCCNTlo                     _MCCNT.Overlap_STR.MCCNTloSTR.Byte
    
  } Overlap_STR;

} MCCNTSTR;
extern volatile MCCNTSTR _MCCNT @(REG_BASE + 0x00000076UL);
#define MCCNT                           _MCCNT.Word


/*** TC0H - Timer Input Capture Holding Registers 0; 0x00000078 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TC0Hhi - Timer Input Capture Holding Registers 0 High; 0x00000078 ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Timer Input Capture Holding Bit 8 */
        byte BIT9        :1;                                       /* Timer Input Capture Holding Bit 9 */
        byte BIT10       :1;                                       /* Timer Input Capture Holding Bit 10 */
        byte BIT11       :1;                                       /* Timer Input Capture Holding Bit 11 */
        byte BIT12       :1;                                       /* Timer Input Capture Holding Bit 12 */
        byte BIT13       :1;                                       /* Timer Input Capture Holding Bit 13 */
        byte BIT14       :1;                                       /* Timer Input Capture Holding Bit 14 */
        byte BIT15       :1;                                       /* Timer Input Capture Holding Bit 15 */
      } Bits;
    } TC0HhiSTR;
    #define TC0Hhi                      _TC0H.Overlap_STR.TC0HhiSTR.Byte
    #define TC0Hhi_BIT8                 _TC0H.Overlap_STR.TC0HhiSTR.Bits.BIT8
    #define TC0Hhi_BIT9                 _TC0H.Overlap_STR.TC0HhiSTR.Bits.BIT9
    #define TC0Hhi_BIT10                _TC0H.Overlap_STR.TC0HhiSTR.Bits.BIT10
    #define TC0Hhi_BIT11                _TC0H.Overlap_STR.TC0HhiSTR.Bits.BIT11
    #define TC0Hhi_BIT12                _TC0H.Overlap_STR.TC0HhiSTR.Bits.BIT12
    #define TC0Hhi_BIT13                _TC0H.Overlap_STR.TC0HhiSTR.Bits.BIT13
    #define TC0Hhi_BIT14                _TC0H.Overlap_STR.TC0HhiSTR.Bits.BIT14
    #define TC0Hhi_BIT15                _TC0H.Overlap_STR.TC0HhiSTR.Bits.BIT15
    
    #define TC0Hhi_BIT8_MASK            1U
    #define TC0Hhi_BIT9_MASK            2U
    #define TC0Hhi_BIT10_MASK           4U
    #define TC0Hhi_BIT11_MASK           8U
    #define TC0Hhi_BIT12_MASK           16U
    #define TC0Hhi_BIT13_MASK           32U
    #define TC0Hhi_BIT14_MASK           64U
    #define TC0Hhi_BIT15_MASK           128U
    

