feaser/openblt/demo_programs/Target/Demo/HCS12_Evbplus_Dragon12p_CodeWarrior/Boot/lib/mc9s12dg256.h
    /*** TC0Hlo - Timer Input Capture Holding Registers 0 Low; 0x00000079 ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Timer Input Capture Holding Bit 0 */
        byte BIT1        :1;                                       /* Timer Input Capture Holding Bit 1 */
        byte BIT2        :1;                                       /* Timer Input Capture Holding Bit 2 */
        byte BIT3        :1;                                       /* Timer Input Capture Holding Bit 3 */
        byte BIT4        :1;                                       /* Timer Input Capture Holding Bit 4 */
        byte BIT5        :1;                                       /* Timer Input Capture Holding Bit 5 */
        byte BIT6        :1;                                       /* Timer Input Capture Holding Bit 6 */
        byte BIT7        :1;                                       /* Timer Input Capture Holding Bit 7 */
      } Bits;
    } TC0HloSTR;
    #define TC0Hlo                      _TC0H.Overlap_STR.TC0HloSTR.Byte
    #define TC0Hlo_BIT0                 _TC0H.Overlap_STR.TC0HloSTR.Bits.BIT0
    #define TC0Hlo_BIT1                 _TC0H.Overlap_STR.TC0HloSTR.Bits.BIT1
    #define TC0Hlo_BIT2                 _TC0H.Overlap_STR.TC0HloSTR.Bits.BIT2
    #define TC0Hlo_BIT3                 _TC0H.Overlap_STR.TC0HloSTR.Bits.BIT3
    #define TC0Hlo_BIT4                 _TC0H.Overlap_STR.TC0HloSTR.Bits.BIT4
    #define TC0Hlo_BIT5                 _TC0H.Overlap_STR.TC0HloSTR.Bits.BIT5
    #define TC0Hlo_BIT6                 _TC0H.Overlap_STR.TC0HloSTR.Bits.BIT6
    #define TC0Hlo_BIT7                 _TC0H.Overlap_STR.TC0HloSTR.Bits.BIT7
    
    #define TC0Hlo_BIT0_MASK            1U
    #define TC0Hlo_BIT1_MASK            2U
    #define TC0Hlo_BIT2_MASK            4U
    #define TC0Hlo_BIT3_MASK            8U
    #define TC0Hlo_BIT4_MASK            16U
    #define TC0Hlo_BIT5_MASK            32U
    #define TC0Hlo_BIT6_MASK            64U
    #define TC0Hlo_BIT7_MASK            128U
    
  } Overlap_STR;

  struct {
    word BIT0        :1;                                       /* Timer Input Capture Holding Bit 0 */
    word BIT1        :1;                                       /* Timer Input Capture Holding Bit 1 */
    word BIT2        :1;                                       /* Timer Input Capture Holding Bit 2 */
    word BIT3        :1;                                       /* Timer Input Capture Holding Bit 3 */
    word BIT4        :1;                                       /* Timer Input Capture Holding Bit 4 */
    word BIT5        :1;                                       /* Timer Input Capture Holding Bit 5 */
    word BIT6        :1;                                       /* Timer Input Capture Holding Bit 6 */
    word BIT7        :1;                                       /* Timer Input Capture Holding Bit 7 */
    word BIT8        :1;                                       /* Timer Input Capture Holding Bit 8 */
    word BIT9        :1;                                       /* Timer Input Capture Holding Bit 9 */
    word BIT10       :1;                                       /* Timer Input Capture Holding Bit 10 */
    word BIT11       :1;                                       /* Timer Input Capture Holding Bit 11 */
    word BIT12       :1;                                       /* Timer Input Capture Holding Bit 12 */
    word BIT13       :1;                                       /* Timer Input Capture Holding Bit 13 */
    word BIT14       :1;                                       /* Timer Input Capture Holding Bit 14 */
    word BIT15       :1;                                       /* Timer Input Capture Holding Bit 15 */
  } Bits;
} TC0HSTR;
extern volatile TC0HSTR _TC0H @(REG_BASE + 0x00000078UL);
#define TC0H                            _TC0H.Word
#define TC0H_BIT0                       _TC0H.Bits.BIT0
#define TC0H_BIT1                       _TC0H.Bits.BIT1
#define TC0H_BIT2                       _TC0H.Bits.BIT2
#define TC0H_BIT3                       _TC0H.Bits.BIT3
#define TC0H_BIT4                       _TC0H.Bits.BIT4
#define TC0H_BIT5                       _TC0H.Bits.BIT5
#define TC0H_BIT6                       _TC0H.Bits.BIT6
#define TC0H_BIT7                       _TC0H.Bits.BIT7
#define TC0H_BIT8                       _TC0H.Bits.BIT8
#define TC0H_BIT9                       _TC0H.Bits.BIT9
#define TC0H_BIT10                      _TC0H.Bits.BIT10
#define TC0H_BIT11                      _TC0H.Bits.BIT11
#define TC0H_BIT12                      _TC0H.Bits.BIT12
#define TC0H_BIT13                      _TC0H.Bits.BIT13
#define TC0H_BIT14                      _TC0H.Bits.BIT14
#define TC0H_BIT15                      _TC0H.Bits.BIT15

#define TC0H_BIT0_MASK                  1U
#define TC0H_BIT1_MASK                  2U
#define TC0H_BIT2_MASK                  4U
#define TC0H_BIT3_MASK                  8U
#define TC0H_BIT4_MASK                  16U
#define TC0H_BIT5_MASK                  32U
#define TC0H_BIT6_MASK                  64U
#define TC0H_BIT7_MASK                  128U
#define TC0H_BIT8_MASK                  256U
#define TC0H_BIT9_MASK                  512U
#define TC0H_BIT10_MASK                 1024U
#define TC0H_BIT11_MASK                 2048U
#define TC0H_BIT12_MASK                 4096U
#define TC0H_BIT13_MASK                 8192U
#define TC0H_BIT14_MASK                 16384U
#define TC0H_BIT15_MASK                 32768U


/*** TC1H - Timer Input Capture Holding Registers 1; 0x0000007A ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TC1Hhi - Timer Input Capture Holding Registers 1 High; 0x0000007A ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Timer Input Capture Holding Bit 8 */
        byte BIT9        :1;                                       /* Timer Input Capture Holding Bit 9 */
        byte BIT10       :1;                                       /* Timer Input Capture Holding Bit 10 */
        byte BIT11       :1;                                       /* Timer Input Capture Holding Bit 11 */
        byte BIT12       :1;                                       /* Timer Input Capture Holding Bit 12 */
        byte BIT13       :1;                                       /* Timer Input Capture Holding Bit 13 */
        byte BIT14       :1;                                       /* Timer Input Capture Holding Bit 14 */
        byte BIT15       :1;                                       /* Timer Input Capture Holding Bit 15 */
      } Bits;
    } TC1HhiSTR;
    #define TC1Hhi                      _TC1H.Overlap_STR.TC1HhiSTR.Byte
    #define TC1Hhi_BIT8                 _TC1H.Overlap_STR.TC1HhiSTR.Bits.BIT8
    #define TC1Hhi_BIT9                 _TC1H.Overlap_STR.TC1HhiSTR.Bits.BIT9
    #define TC1Hhi_BIT10                _TC1H.Overlap_STR.TC1HhiSTR.Bits.BIT10
    #define TC1Hhi_BIT11                _TC1H.Overlap_STR.TC1HhiSTR.Bits.BIT11
    #define TC1Hhi_BIT12                _TC1H.Overlap_STR.TC1HhiSTR.Bits.BIT12
    #define TC1Hhi_BIT13                _TC1H.Overlap_STR.TC1HhiSTR.Bits.BIT13
    #define TC1Hhi_BIT14                _TC1H.Overlap_STR.TC1HhiSTR.Bits.BIT14
    #define TC1Hhi_BIT15                _TC1H.Overlap_STR.TC1HhiSTR.Bits.BIT15
    
    #define TC1Hhi_BIT8_MASK            1U
    #define TC1Hhi_BIT9_MASK            2U
    #define TC1Hhi_BIT10_MASK           4U
    #define TC1Hhi_BIT11_MASK           8U
    #define TC1Hhi_BIT12_MASK           16U
    #define TC1Hhi_BIT13_MASK           32U
    #define TC1Hhi_BIT14_MASK           64U
    #define TC1Hhi_BIT15_MASK           128U
    

    /*** TC1Hlo - Timer Input Capture Holding Registers 1 Low; 0x0000007B ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Timer Input Capture Holding Bit 0 */
        byte BIT1        :1;                                       /* Timer Input Capture Holding Bit 1 */
        byte BIT2        :1;                                       /* Timer Input Capture Holding Bit 2 */
        byte BIT3        :1;                                       /* Timer Input Capture Holding Bit 3 */
        byte BIT4        :1;                                       /* Timer Input Capture Holding Bit 4 */
        byte BIT5        :1;                                       /* Timer Input Capture Holding Bit 5 */
        byte BIT6        :1;                                       /* Timer Input Capture Holding Bit 6 */
        byte BIT7        :1;                                       /* Timer Input Capture Holding Bit 7 */
      } Bits;
    } TC1HloSTR;
    #define TC1Hlo                      _TC1H.Overlap_STR.TC1HloSTR.Byte
    #define TC1Hlo_BIT0                 _TC1H.Overlap_STR.TC1HloSTR.Bits.BIT0
    #define TC1Hlo_BIT1                 _TC1H.Overlap_STR.TC1HloSTR.Bits.BIT1
    #define TC1Hlo_BIT2                 _TC1H.Overlap_STR.TC1HloSTR.Bits.BIT2
    #define TC1Hlo_BIT3                 _TC1H.Overlap_STR.TC1HloSTR.Bits.BIT3
    #define TC1Hlo_BIT4                 _TC1H.Overlap_STR.TC1HloSTR.Bits.BIT4
    #define TC1Hlo_BIT5                 _TC1H.Overlap_STR.TC1HloSTR.Bits.BIT5
    #define TC1Hlo_BIT6                 _TC1H.Overlap_STR.TC1HloSTR.Bits.BIT6
    #define TC1Hlo_BIT7                 _TC1H.Overlap_STR.TC1HloSTR.Bits.BIT7
    
