feaser/openblt/demo_programs/Target/Demo/HCS12_Evbplus_Dragon12p_CodeWarrior/Boot/lib/mc9s12dg256.h
/*** CAN4RXDSR2 - MSCAN4 Receive Data Segment Register 2; 0x000002A6 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN4RXDSR2STR;
extern volatile CAN4RXDSR2STR _CAN4RXDSR2 @(REG_BASE + 0x000002A6UL);
#define CAN4RXDSR2                      _CAN4RXDSR2.Byte
#define CAN4RXDSR2_DB0                  _CAN4RXDSR2.Bits.DB0
#define CAN4RXDSR2_DB1                  _CAN4RXDSR2.Bits.DB1
#define CAN4RXDSR2_DB2                  _CAN4RXDSR2.Bits.DB2
#define CAN4RXDSR2_DB3                  _CAN4RXDSR2.Bits.DB3
#define CAN4RXDSR2_DB4                  _CAN4RXDSR2.Bits.DB4
#define CAN4RXDSR2_DB5                  _CAN4RXDSR2.Bits.DB5
#define CAN4RXDSR2_DB6                  _CAN4RXDSR2.Bits.DB6
#define CAN4RXDSR2_DB7                  _CAN4RXDSR2.Bits.DB7

#define CAN4RXDSR2_DB0_MASK             1U
#define CAN4RXDSR2_DB1_MASK             2U
#define CAN4RXDSR2_DB2_MASK             4U
#define CAN4RXDSR2_DB3_MASK             8U
#define CAN4RXDSR2_DB4_MASK             16U
#define CAN4RXDSR2_DB5_MASK             32U
#define CAN4RXDSR2_DB6_MASK             64U
#define CAN4RXDSR2_DB7_MASK             128U


/*** CAN4RXDSR3 - MSCAN4 Receive Data Segment Register 3; 0x000002A7 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN4RXDSR3STR;
extern volatile CAN4RXDSR3STR _CAN4RXDSR3 @(REG_BASE + 0x000002A7UL);
#define CAN4RXDSR3                      _CAN4RXDSR3.Byte
#define CAN4RXDSR3_DB0                  _CAN4RXDSR3.Bits.DB0
#define CAN4RXDSR3_DB1                  _CAN4RXDSR3.Bits.DB1
#define CAN4RXDSR3_DB2                  _CAN4RXDSR3.Bits.DB2
#define CAN4RXDSR3_DB3                  _CAN4RXDSR3.Bits.DB3
#define CAN4RXDSR3_DB4                  _CAN4RXDSR3.Bits.DB4
#define CAN4RXDSR3_DB5                  _CAN4RXDSR3.Bits.DB5
#define CAN4RXDSR3_DB6                  _CAN4RXDSR3.Bits.DB6
#define CAN4RXDSR3_DB7                  _CAN4RXDSR3.Bits.DB7

#define CAN4RXDSR3_DB0_MASK             1U
#define CAN4RXDSR3_DB1_MASK             2U
#define CAN4RXDSR3_DB2_MASK             4U
#define CAN4RXDSR3_DB3_MASK             8U
#define CAN4RXDSR3_DB4_MASK             16U
#define CAN4RXDSR3_DB5_MASK             32U
#define CAN4RXDSR3_DB6_MASK             64U
#define CAN4RXDSR3_DB7_MASK             128U


/*** CAN4RXDSR4 - MSCAN4 Receive Data Segment Register 4; 0x000002A8 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN4RXDSR4STR;
extern volatile CAN4RXDSR4STR _CAN4RXDSR4 @(REG_BASE + 0x000002A8UL);
#define CAN4RXDSR4                      _CAN4RXDSR4.Byte
#define CAN4RXDSR4_DB0                  _CAN4RXDSR4.Bits.DB0
#define CAN4RXDSR4_DB1                  _CAN4RXDSR4.Bits.DB1
#define CAN4RXDSR4_DB2                  _CAN4RXDSR4.Bits.DB2
#define CAN4RXDSR4_DB3                  _CAN4RXDSR4.Bits.DB3
#define CAN4RXDSR4_DB4                  _CAN4RXDSR4.Bits.DB4
#define CAN4RXDSR4_DB5                  _CAN4RXDSR4.Bits.DB5
#define CAN4RXDSR4_DB6                  _CAN4RXDSR4.Bits.DB6
#define CAN4RXDSR4_DB7                  _CAN4RXDSR4.Bits.DB7

#define CAN4RXDSR4_DB0_MASK             1U
#define CAN4RXDSR4_DB1_MASK             2U
#define CAN4RXDSR4_DB2_MASK             4U
#define CAN4RXDSR4_DB3_MASK             8U
#define CAN4RXDSR4_DB4_MASK             16U
#define CAN4RXDSR4_DB5_MASK             32U
#define CAN4RXDSR4_DB6_MASK             64U
#define CAN4RXDSR4_DB7_MASK             128U


/*** CAN4RXDSR5 - MSCAN4 Receive Data Segment Register 5; 0x000002A9 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN4RXDSR5STR;
extern volatile CAN4RXDSR5STR _CAN4RXDSR5 @(REG_BASE + 0x000002A9UL);
#define CAN4RXDSR5                      _CAN4RXDSR5.Byte
#define CAN4RXDSR5_DB0                  _CAN4RXDSR5.Bits.DB0
#define CAN4RXDSR5_DB1                  _CAN4RXDSR5.Bits.DB1
#define CAN4RXDSR5_DB2                  _CAN4RXDSR5.Bits.DB2
#define CAN4RXDSR5_DB3                  _CAN4RXDSR5.Bits.DB3
#define CAN4RXDSR5_DB4                  _CAN4RXDSR5.Bits.DB4
#define CAN4RXDSR5_DB5                  _CAN4RXDSR5.Bits.DB5
#define CAN4RXDSR5_DB6                  _CAN4RXDSR5.Bits.DB6
#define CAN4RXDSR5_DB7                  _CAN4RXDSR5.Bits.DB7

