feaser/openblt/demo_programs/Target/Demo/HCS12_Evbplus_Dragon12p_CodeWarrior/Boot/lib/mc9s12dg256.h
    /*** CAN4RXTSRL - MSCAN 4 Receive Time Stamp Register Low; 0x000002AF ***/
    union {
      byte Byte;
      struct {
        byte TSR0        :1;                                       /* Time Stamp Bit 0 */
        byte TSR1        :1;                                       /* Time Stamp Bit 1 */
        byte TSR2        :1;                                       /* Time Stamp Bit 2 */
        byte TSR3        :1;                                       /* Time Stamp Bit 3 */
        byte TSR4        :1;                                       /* Time Stamp Bit 4 */
        byte TSR5        :1;                                       /* Time Stamp Bit 5 */
        byte TSR6        :1;                                       /* Time Stamp Bit 6 */
        byte TSR7        :1;                                       /* Time Stamp Bit 7 */
      } Bits;
    } CAN4RXTSRLSTR;
    #define CAN4RXTSRL                  _CAN4RXTSR.Overlap_STR.CAN4RXTSRLSTR.Byte
    #define CAN4RXTSRL_TSR0             _CAN4RXTSR.Overlap_STR.CAN4RXTSRLSTR.Bits.TSR0
    #define CAN4RXTSRL_TSR1             _CAN4RXTSR.Overlap_STR.CAN4RXTSRLSTR.Bits.TSR1
    #define CAN4RXTSRL_TSR2             _CAN4RXTSR.Overlap_STR.CAN4RXTSRLSTR.Bits.TSR2
    #define CAN4RXTSRL_TSR3             _CAN4RXTSR.Overlap_STR.CAN4RXTSRLSTR.Bits.TSR3
    #define CAN4RXTSRL_TSR4             _CAN4RXTSR.Overlap_STR.CAN4RXTSRLSTR.Bits.TSR4
    #define CAN4RXTSRL_TSR5             _CAN4RXTSR.Overlap_STR.CAN4RXTSRLSTR.Bits.TSR5
    #define CAN4RXTSRL_TSR6             _CAN4RXTSR.Overlap_STR.CAN4RXTSRLSTR.Bits.TSR6
    #define CAN4RXTSRL_TSR7             _CAN4RXTSR.Overlap_STR.CAN4RXTSRLSTR.Bits.TSR7
    
    #define CAN4RXTSRL_TSR0_MASK        1U
    #define CAN4RXTSRL_TSR1_MASK        2U
    #define CAN4RXTSRL_TSR2_MASK        4U
    #define CAN4RXTSRL_TSR3_MASK        8U
    #define CAN4RXTSRL_TSR4_MASK        16U
    #define CAN4RXTSRL_TSR5_MASK        32U
    #define CAN4RXTSRL_TSR6_MASK        64U
    #define CAN4RXTSRL_TSR7_MASK        128U
    
  } Overlap_STR;

  struct {
    word TSR0        :1;                                       /* Time Stamp Bit 0 */
    word TSR1        :1;                                       /* Time Stamp Bit 1 */
    word TSR2        :1;                                       /* Time Stamp Bit 2 */
    word TSR3        :1;                                       /* Time Stamp Bit 3 */
    word TSR4        :1;                                       /* Time Stamp Bit 4 */
    word TSR5        :1;                                       /* Time Stamp Bit 5 */
    word TSR6        :1;                                       /* Time Stamp Bit 6 */
    word TSR7        :1;                                       /* Time Stamp Bit 7 */
    word TSR8        :1;                                       /* Time Stamp Bit 8 */
    word TSR9        :1;                                       /* Time Stamp Bit 9 */
    word TSR10       :1;                                       /* Time Stamp Bit 10 */
    word TSR11       :1;                                       /* Time Stamp Bit 11 */
    word TSR12       :1;                                       /* Time Stamp Bit 12 */
    word TSR13       :1;                                       /* Time Stamp Bit 13 */
    word TSR14       :1;                                       /* Time Stamp Bit 14 */
    word TSR15       :1;                                       /* Time Stamp Bit 15 */
  } Bits;
} CAN4RXTSRSTR;
extern volatile CAN4RXTSRSTR _CAN4RXTSR @(REG_BASE + 0x000002AEUL);
#define CAN4RXTSR                       _CAN4RXTSR.Word
#define CAN4RXTSR_TSR0                  _CAN4RXTSR.Bits.TSR0
#define CAN4RXTSR_TSR1                  _CAN4RXTSR.Bits.TSR1
#define CAN4RXTSR_TSR2                  _CAN4RXTSR.Bits.TSR2
#define CAN4RXTSR_TSR3                  _CAN4RXTSR.Bits.TSR3
#define CAN4RXTSR_TSR4                  _CAN4RXTSR.Bits.TSR4
#define CAN4RXTSR_TSR5                  _CAN4RXTSR.Bits.TSR5
#define CAN4RXTSR_TSR6                  _CAN4RXTSR.Bits.TSR6
#define CAN4RXTSR_TSR7                  _CAN4RXTSR.Bits.TSR7
#define CAN4RXTSR_TSR8                  _CAN4RXTSR.Bits.TSR8
#define CAN4RXTSR_TSR9                  _CAN4RXTSR.Bits.TSR9
#define CAN4RXTSR_TSR10                 _CAN4RXTSR.Bits.TSR10
#define CAN4RXTSR_TSR11                 _CAN4RXTSR.Bits.TSR11
#define CAN4RXTSR_TSR12                 _CAN4RXTSR.Bits.TSR12
#define CAN4RXTSR_TSR13                 _CAN4RXTSR.Bits.TSR13
#define CAN4RXTSR_TSR14                 _CAN4RXTSR.Bits.TSR14
#define CAN4RXTSR_TSR15                 _CAN4RXTSR.Bits.TSR15

#define CAN4RXTSR_TSR0_MASK             1U
#define CAN4RXTSR_TSR1_MASK             2U
#define CAN4RXTSR_TSR2_MASK             4U
#define CAN4RXTSR_TSR3_MASK             8U
#define CAN4RXTSR_TSR4_MASK             16U
#define CAN4RXTSR_TSR5_MASK             32U
#define CAN4RXTSR_TSR6_MASK             64U
#define CAN4RXTSR_TSR7_MASK             128U
#define CAN4RXTSR_TSR8_MASK             256U
#define CAN4RXTSR_TSR9_MASK             512U
#define CAN4RXTSR_TSR10_MASK            1024U
#define CAN4RXTSR_TSR11_MASK            2048U
#define CAN4RXTSR_TSR12_MASK            4096U
#define CAN4RXTSR_TSR13_MASK            8192U
#define CAN4RXTSR_TSR14_MASK            16384U
#define CAN4RXTSR_TSR15_MASK            32768U


/*** CAN4TXIDR0 - MSCAN4 Transmit Identifier Register 0; 0x000002B0 ***/
typedef union {
  byte Byte;
  struct {
    byte ID21        :1;                                       /* Extended format identifier Bit 21 */
    byte ID22        :1;                                       /* Extended format identifier Bit 22 */
    byte ID23        :1;                                       /* Extended format identifier Bit 23 */
    byte ID24        :1;                                       /* Extended format identifier Bit 24 */
    byte ID25        :1;                                       /* Extended format identifier Bit 25 */
    byte ID26        :1;                                       /* Extended format identifier Bit 26 */
    byte ID27        :1;                                       /* Extended format identifier Bit 27 */
    byte ID28        :1;                                       /* Extended format identifier Bit 28 */
  } Bits;
} CAN4TXIDR0STR;
