feaser/openblt/demo_programs/Target/Demo/HCS12_Evbplus_Dragon12p_CodeWarrior/Boot/lib/mc9s12dg256.h
extern volatile CAN4TXIDR0STR _CAN4TXIDR0 @(REG_BASE + 0x000002B0UL);
#define CAN4TXIDR0                      _CAN4TXIDR0.Byte
#define CAN4TXIDR0_ID21                 _CAN4TXIDR0.Bits.ID21
#define CAN4TXIDR0_ID22                 _CAN4TXIDR0.Bits.ID22
#define CAN4TXIDR0_ID23                 _CAN4TXIDR0.Bits.ID23
#define CAN4TXIDR0_ID24                 _CAN4TXIDR0.Bits.ID24
#define CAN4TXIDR0_ID25                 _CAN4TXIDR0.Bits.ID25
#define CAN4TXIDR0_ID26                 _CAN4TXIDR0.Bits.ID26
#define CAN4TXIDR0_ID27                 _CAN4TXIDR0.Bits.ID27
#define CAN4TXIDR0_ID28                 _CAN4TXIDR0.Bits.ID28
/* CAN4TXIDR_ARR: Access 4 CAN4TXIDRx registers in an array */
#define CAN4TXIDR_ARR                   ((volatile byte *) &CAN4TXIDR0)

#define CAN4TXIDR0_ID21_MASK            1U
#define CAN4TXIDR0_ID22_MASK            2U
#define CAN4TXIDR0_ID23_MASK            4U
#define CAN4TXIDR0_ID24_MASK            8U
#define CAN4TXIDR0_ID25_MASK            16U
#define CAN4TXIDR0_ID26_MASK            32U
#define CAN4TXIDR0_ID27_MASK            64U
#define CAN4TXIDR0_ID28_MASK            128U


/*** CAN4TXIDR1 - MSCAN4 Transmit Identifier Register 1; 0x000002B1 ***/
typedef union {
  byte Byte;
  struct {
    byte ID15        :1;                                       /* Extended format identifier Bit 15 */
    byte ID16        :1;                                       /* Extended format identifier Bit 16 */
    byte ID17        :1;                                       /* Extended format identifier Bit 17 */
    byte IDE         :1;                                       /* ID Extended */
    byte SRR         :1;                                       /* Substitute Remote Request */
    byte ID18        :1;                                       /* Extended format identifier Bit 18 */
    byte ID19        :1;                                       /* Extended format identifier Bit 19 */
    byte ID20        :1;                                       /* Extended format identifier Bit 20 */
  } Bits;
  struct {
    byte grpID_15 :3;
    byte         :1;
    byte         :1;
    byte grpID_18 :3;
  } MergedBits;
} CAN4TXIDR1STR;
extern volatile CAN4TXIDR1STR _CAN4TXIDR1 @(REG_BASE + 0x000002B1UL);
#define CAN4TXIDR1                      _CAN4TXIDR1.Byte
#define CAN4TXIDR1_ID15                 _CAN4TXIDR1.Bits.ID15
#define CAN4TXIDR1_ID16                 _CAN4TXIDR1.Bits.ID16
#define CAN4TXIDR1_ID17                 _CAN4TXIDR1.Bits.ID17
#define CAN4TXIDR1_IDE                  _CAN4TXIDR1.Bits.IDE
#define CAN4TXIDR1_SRR                  _CAN4TXIDR1.Bits.SRR
#define CAN4TXIDR1_ID18                 _CAN4TXIDR1.Bits.ID18
#define CAN4TXIDR1_ID19                 _CAN4TXIDR1.Bits.ID19
#define CAN4TXIDR1_ID20                 _CAN4TXIDR1.Bits.ID20
#define CAN4TXIDR1_ID_15                _CAN4TXIDR1.MergedBits.grpID_15
#define CAN4TXIDR1_ID_18                _CAN4TXIDR1.MergedBits.grpID_18
#define CAN4TXIDR1_ID                   CAN4TXIDR1_ID_15

#define CAN4TXIDR1_ID15_MASK            1U
#define CAN4TXIDR1_ID16_MASK            2U
#define CAN4TXIDR1_ID17_MASK            4U
#define CAN4TXIDR1_IDE_MASK             8U
#define CAN4TXIDR1_SRR_MASK             16U
#define CAN4TXIDR1_ID18_MASK            32U
#define CAN4TXIDR1_ID19_MASK            64U
#define CAN4TXIDR1_ID20_MASK            128U
#define CAN4TXIDR1_ID_15_MASK           7U
#define CAN4TXIDR1_ID_15_BITNUM         0U
#define CAN4TXIDR1_ID_18_MASK           224U
#define CAN4TXIDR1_ID_18_BITNUM         5U


/*** CAN4TXIDR2 - MSCAN4 Transmit Identifier Register 2; 0x000002B2 ***/
typedef union {
  byte Byte;
  struct {
    byte ID7         :1;                                       /* Extended format identifier Bit 7 */
    byte ID8         :1;                                       /* Extended format identifier Bit 8 */
    byte ID9         :1;                                       /* Extended format identifier Bit 9 */
    byte ID10        :1;                                       /* Extended format identifier Bit 10 */
    byte ID11        :1;                                       /* Extended format identifier Bit 11 */
    byte ID12        :1;                                       /* Extended format identifier Bit 12 */
    byte ID13        :1;                                       /* Extended format identifier Bit 13 */
    byte ID14        :1;                                       /* Extended format identifier Bit 14 */
  } Bits;
} CAN4TXIDR2STR;
extern volatile CAN4TXIDR2STR _CAN4TXIDR2 @(REG_BASE + 0x000002B2UL);
#define CAN4TXIDR2                      _CAN4TXIDR2.Byte
#define CAN4TXIDR2_ID7                  _CAN4TXIDR2.Bits.ID7
#define CAN4TXIDR2_ID8                  _CAN4TXIDR2.Bits.ID8
#define CAN4TXIDR2_ID9                  _CAN4TXIDR2.Bits.ID9
#define CAN4TXIDR2_ID10                 _CAN4TXIDR2.Bits.ID10
#define CAN4TXIDR2_ID11                 _CAN4TXIDR2.Bits.ID11
#define CAN4TXIDR2_ID12                 _CAN4TXIDR2.Bits.ID12
#define CAN4TXIDR2_ID13                 _CAN4TXIDR2.Bits.ID13
#define CAN4TXIDR2_ID14                 _CAN4TXIDR2.Bits.ID14

#define CAN4TXIDR2_ID7_MASK             1U
#define CAN4TXIDR2_ID8_MASK             2U
#define CAN4TXIDR2_ID9_MASK             4U
#define CAN4TXIDR2_ID10_MASK            8U
#define CAN4TXIDR2_ID11_MASK            16U
#define CAN4TXIDR2_ID12_MASK            32U
#define CAN4TXIDR2_ID13_MASK            64U
#define CAN4TXIDR2_ID14_MASK            128U


/*** CAN4TXIDR3 - MSCAN4 Transmit Identifier Register 3; 0x000002B3 ***/
typedef union {
  byte Byte;
  struct {
    byte RTR         :1;                                       /* Remote Transmission Request */
    byte ID0         :1;                                       /* Extended format identifier Bit 0 */
    byte ID1         :1;                                       /* Extended format identifier Bit 1 */
    byte ID2         :1;                                       /* Extended format identifier Bit 2 */
    byte ID3         :1;                                       /* Extended format identifier Bit 3 */
    byte ID4         :1;                                       /* Extended format identifier Bit 4 */
    byte ID5         :1;                                       /* Extended format identifier Bit 5 */
    byte ID6         :1;                                       /* Extended format identifier Bit 6 */
  } Bits;
  struct {
    byte         :1;
    byte grpID   :7;
  } MergedBits;
} CAN4TXIDR3STR;
extern volatile CAN4TXIDR3STR _CAN4TXIDR3 @(REG_BASE + 0x000002B3UL);
#define CAN4TXIDR3                      _CAN4TXIDR3.Byte
#define CAN4TXIDR3_RTR                  _CAN4TXIDR3.Bits.RTR
#define CAN4TXIDR3_ID0                  _CAN4TXIDR3.Bits.ID0
#define CAN4TXIDR3_ID1                  _CAN4TXIDR3.Bits.ID1
#define CAN4TXIDR3_ID2                  _CAN4TXIDR3.Bits.ID2
#define CAN4TXIDR3_ID3                  _CAN4TXIDR3.Bits.ID3
#define CAN4TXIDR3_ID4                  _CAN4TXIDR3.Bits.ID4
#define CAN4TXIDR3_ID5                  _CAN4TXIDR3.Bits.ID5
#define CAN4TXIDR3_ID6                  _CAN4TXIDR3.Bits.ID6
#define CAN4TXIDR3_ID                   _CAN4TXIDR3.MergedBits.grpID

#define CAN4TXIDR3_RTR_MASK             1U
#define CAN4TXIDR3_ID0_MASK             2U
#define CAN4TXIDR3_ID1_MASK             4U
#define CAN4TXIDR3_ID2_MASK             8U
#define CAN4TXIDR3_ID3_MASK             16U
#define CAN4TXIDR3_ID4_MASK             32U
#define CAN4TXIDR3_ID5_MASK             64U
#define CAN4TXIDR3_ID6_MASK             128U
#define CAN4TXIDR3_ID_MASK              254U
#define CAN4TXIDR3_ID_BITNUM            1U


/*** CAN4TXDSR0 - MSCAN4 Transmit Data Segment Register 0; 0x000002B4 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN4TXDSR0STR;
extern volatile CAN4TXDSR0STR _CAN4TXDSR0 @(REG_BASE + 0x000002B4UL);
#define CAN4TXDSR0                      _CAN4TXDSR0.Byte
#define CAN4TXDSR0_DB0                  _CAN4TXDSR0.Bits.DB0
#define CAN4TXDSR0_DB1                  _CAN4TXDSR0.Bits.DB1
#define CAN4TXDSR0_DB2                  _CAN4TXDSR0.Bits.DB2
#define CAN4TXDSR0_DB3                  _CAN4TXDSR0.Bits.DB3
#define CAN4TXDSR0_DB4                  _CAN4TXDSR0.Bits.DB4
#define CAN4TXDSR0_DB5                  _CAN4TXDSR0.Bits.DB5
#define CAN4TXDSR0_DB6                  _CAN4TXDSR0.Bits.DB6
#define CAN4TXDSR0_DB7                  _CAN4TXDSR0.Bits.DB7
/* CAN4TXDSR_ARR: Access 8 CAN4TXDSRx registers in an array */
#define CAN4TXDSR_ARR                   ((volatile byte *) &CAN4TXDSR0)

#define CAN4TXDSR0_DB0_MASK             1U
#define CAN4TXDSR0_DB1_MASK             2U
#define CAN4TXDSR0_DB2_MASK             4U
#define CAN4TXDSR0_DB3_MASK             8U
#define CAN4TXDSR0_DB4_MASK             16U
#define CAN4TXDSR0_DB5_MASK             32U
#define CAN4TXDSR0_DB6_MASK             64U
#define CAN4TXDSR0_DB7_MASK             128U


/*** CAN4TXDSR1 - MSCAN4 Transmit Data Segment Register 1; 0x000002B5 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN4TXDSR1STR;
extern volatile CAN4TXDSR1STR _CAN4TXDSR1 @(REG_BASE + 0x000002B5UL);
#define CAN4TXDSR1                      _CAN4TXDSR1.Byte
#define CAN4TXDSR1_DB0                  _CAN4TXDSR1.Bits.DB0
#define CAN4TXDSR1_DB1                  _CAN4TXDSR1.Bits.DB1
#define CAN4TXDSR1_DB2                  _CAN4TXDSR1.Bits.DB2
#define CAN4TXDSR1_DB3                  _CAN4TXDSR1.Bits.DB3
#define CAN4TXDSR1_DB4                  _CAN4TXDSR1.Bits.DB4
#define CAN4TXDSR1_DB5                  _CAN4TXDSR1.Bits.DB5
#define CAN4TXDSR1_DB6                  _CAN4TXDSR1.Bits.DB6
#define CAN4TXDSR1_DB7                  _CAN4TXDSR1.Bits.DB7

#define CAN4TXDSR1_DB0_MASK             1U
#define CAN4TXDSR1_DB1_MASK             2U
#define CAN4TXDSR1_DB2_MASK             4U
#define CAN4TXDSR1_DB3_MASK             8U
#define CAN4TXDSR1_DB4_MASK             16U
#define CAN4TXDSR1_DB5_MASK             32U
#define CAN4TXDSR1_DB6_MASK             64U
#define CAN4TXDSR1_DB7_MASK             128U


/*** CAN4TXDSR2 - MSCAN4 Transmit Data Segment Register 2; 0x000002B6 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN4TXDSR2STR;
extern volatile CAN4TXDSR2STR _CAN4TXDSR2 @(REG_BASE + 0x000002B6UL);
#define CAN4TXDSR2                      _CAN4TXDSR2.Byte
#define CAN4TXDSR2_DB0                  _CAN4TXDSR2.Bits.DB0
#define CAN4TXDSR2_DB1                  _CAN4TXDSR2.Bits.DB1
#define CAN4TXDSR2_DB2                  _CAN4TXDSR2.Bits.DB2
#define CAN4TXDSR2_DB3                  _CAN4TXDSR2.Bits.DB3
#define CAN4TXDSR2_DB4                  _CAN4TXDSR2.Bits.DB4
#define CAN4TXDSR2_DB5                  _CAN4TXDSR2.Bits.DB5
#define CAN4TXDSR2_DB6                  _CAN4TXDSR2.Bits.DB6
#define CAN4TXDSR2_DB7                  _CAN4TXDSR2.Bits.DB7

